export const zenkakuToHankaku = (input_string) => {
    // 全銀形式で使用可能な文字を半角に変換する。使用不可能な文字を受け取った場合はエラーとする。
    // 特に、ダブルクォーテーションは使用不可能。
    const zenkaku_array = [
        "ア","イ","ウ","エ","オ","カ","キ","ク","ケ","コ"
        ,"サ","シ","ス","セ","ソ","タ","チ","ツ","テ","ト"
        ,"ナ","ニ","ヌ","ネ","ノ","ハ","ヒ","フ","ヘ","ホ"
        ,"マ","ミ","ム","メ","モ","ヤ","ユ","ヨ"
        ,"ラ","リ","ル","レ","ロ","ワ","ヰ","ヱ","ヲ","ン"
        ,"ガ","ギ","グ","ゲ","ゴ","ザ","ジ","ズ","ゼ","ゾ"
        ,"ダ","ヂ","ヅ","デ","ド","バ","ビ","ブ","ベ","ボ"
        ,"ヴ"
        ,"パ","ピ","プ","ペ","ポ"
        ,"ァ","ィ","ゥ","ェ","ォ","ャ","ュ","ョ","ッ"
        ,"ｧ","ｨ","ｩ","ｪ","ｫ","ｬ","ｭ","ｮ","ｯ" // もともと半角なのに拗音・促音が使用不可としてエラーになるのを防ぐ
        ,"゛","°","、","。","「","」","ー","・","（","）","￥","／","．"
        ,"－","‐","―","─","━"
        ,"Ａ","Ｂ","Ｃ","Ｄ","Ｅ","Ｆ","Ｇ","Ｈ","Ｉ","Ｊ","Ｋ","Ｌ","Ｍ","Ｎ","Ｏ","Ｐ","Ｑ","Ｒ","Ｓ","Ｔ","Ｕ","Ｖ","Ｗ","Ｘ","Ｙ","Ｚ"
        ,"ａ","ｂ","ｃ","ｄ","ｅ","ｆ","ｇ","ｈ","ｉ","ｊ","ｋ","ｌ","ｍ","ｎ","ｏ","ｐ","ｑ","ｒ","ｓ","ｔ","ｕ","ｖ","ｗ","ｘ","ｙ","ｚ"
        ,"０","１","２","３","４","５","６","７","８","９"
        ,"　"
    ];

    const hankaku_array = [
        "ｱ","ｲ","ｳ","ｴ","ｵ","ｶ","ｷ","ｸ","ｹ","ｺ"
        ,"ｻ","ｼ","ｽ","ｾ","ｿ","ﾀ","ﾁ","ﾂ","ﾃ","ﾄ"
        ,"ﾅ","ﾆ","ﾇ","ﾈ","ﾉ","ﾊ","ﾋ","ﾌ","ﾍ","ﾎ"
        ,"ﾏ","ﾐ","ﾑ","ﾒ","ﾓ","ﾔ","ﾕ","ﾖ"
        ,"ﾗ","ﾘ","ﾙ","ﾚ","ﾛ","ﾜ","ｲ","ｴ","ｦ","ﾝ"
        ,"ｶﾞ","ｷﾞ","ｸﾞ","ｹﾞ","ｺﾞ","ｻﾞ","ｼﾞ","ｽﾞ","ｾﾞ","ｿﾞ"
        ,"ﾀﾞ","ﾁﾞ","ﾂﾞ","ﾃﾞ","ﾄﾞ","ﾊﾞ","ﾋﾞ","ﾌﾞ","ﾍﾞ","ﾎﾞ"
        ,"ｳﾞ"
        ,"ﾊﾟ","ﾋﾟ","ﾌﾟ","ﾍﾟ","ﾎﾟ"
        ,"ｱ","ｲ","ｳ","ｴ","ｵ","ﾔ","ﾕ","ﾖ","ﾂ"
        ,"ｱ","ｲ","ｳ","ｴ","ｵ","ﾔ","ﾕ","ﾖ","ﾂ"
        ,"ﾞ","ﾟ",",",".","｢","｣","-"," ","(",")","\\","/","." //中黒は使用不可能なのでスペースにする。
        ,"-","-","-","-","-"
        ,"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"
        ,"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"
        ,"0","1","2","3","4","5","6","7","8","9"
        ," "
    ];

    let converted_han = "";

    for (let i = 0; i < input_string.length; i++){
        const input_char = input_string.charAt(i);
        if (hankaku_array.includes(input_char)) {
            // 元々半角文字だったらそのまま使う
            converted_han += input_char;
        } else if (zenkaku_array.includes(input_char)){
            // 使えるけど全角の文字は半角にして使う
            converted_han += hankaku_array[zenkaku_array.indexOf(input_char)];
        } else {
            // 使えない文字はエラー
            throw new Error(`振込データに使用できない文字が含まれています：${input_string}`);
        }
    }

    return converted_han;
};
